<?php

namespace Faker\Provider\ku_SO;

class Color extends \Faker\Provider\Color
{
    protected static $safeColorNames = array(
        'ڕەش', 'سور', 'سەوز',
        'ئەرخەوانی', 'زەرد', 'مۆر', 'شین',
         'نیلی', 'پرتەقاڵی', 'رەساسی',
    );
    
    /**
     * @link https://ku.wikipedia.org/wiki/ڕەنگ
     **/
    protected static $allColorNames = array(
        'سور','سوری تۆخ' ,'سوری کاڵ','ڕەش','ڕەشی تۆخ','ڕەشی کاڵ','سەوز','سەوزی تۆخ',
        'سەوزی کاڵ','ئەرخەوانی','ئەرخەوانی تۆخ','ئەرخەوانی کاڵ','زەرد','زەردی تۆخ',
        'زەردی کاڵ','مۆر','مۆری تۆخ','مۆری کاڵ','شین','شینی تۆخ','شینی کاڵ','نیلی',
        'نیلی تۆخ','نیلی کاڵ','پرتەقاڵی','پرتەقاڵی تۆخ','پرتەقاڵی کاڵ','رەساسی',
        'رەساسی تۆخ','رەساسی کاڵ','سەوزی تۆخ','سەوزی کاڵ','ئەرخەوانی','ئەرخەوانی تۆخ',
        'ئەرخەوانی کاڵ','زەرد','زەردی تۆخ','زەردی کاڵ','مۆر','مۆری تۆخ','مۆری کاڵ','شین',
        'شینی تۆخ','شینی کاڵ','نیلی','نیلی تۆخ','نیلی کاڵ','پرتەقاڵی','پرتەقاڵی تۆخ','پرتەقاڵی کاڵ',
        'رەساسی','رەساسی تۆخ','رەساسی کاڵ','سەوزی تۆخ','سەوزی کاڵ','ئەرخەوانی','ئەرخەوانی تۆخ','ئەرخەوانی کاڵ',
        'زەرد','زەردی تۆخ','زەردی کاڵ','مۆر','مۆری تۆخ','مۆری کاڵ','شین','شینی تۆخ',
        'شینی کاڵ','نیلی','نیلی تۆخ','نیلی کاڵ','پرتەقاڵی','پرتەقاڵی تۆخ','پرتەقاڵی کاڵ',
        'رەساسی','رەساسی تۆخ','رەساسی کاڵ','سەوزی تۆخ','سەوزی کاڵ','ئەرخەوانی','ئەرخەوانی تۆخ',
        'ئەرخەوانی کاڵ','زەرد','زەردی تۆخ','زەردی کاڵ','مۆر','مۆری تۆخ','مۆری کاڵ','شین','شینی تۆخ',
        'شینی کاڵ','نیلی','نیلی تۆخ','نیلی کاڵ','پرتەقاڵی','پرتەقاڵی تۆخ','پرتەقاڵی کاڵ','رەساسی',
        'رەساسی تۆخ','رەساسی کاڵ'
    );
}
