<?php

namespace Faker\Provider\ku_SO;

use Faker\Calculator\Luhn;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{firstNameMale}} {{firstNameMale}} {{lastName}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastName}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{firstNameMale}} {{lastName}}',
        '{{firstNameFemale}} {{firstNameMale}} {{firstNameMale}} {{lastName}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastName}}',
    );

    /**
     */
    protected static $firstNameMale = array(
        'ئاراز', 'ئاراس', 'ئارام', 'ئاری', 'ئاریانزادە', 'ئازا', 'ئازاد', 'ئاسنگەر', 'ئاسۆ', 'ئاكام', 'ئاكۆ', 'ئاكۆیان', 'ئاگا', 'ئاگری', 'ئاگرین', 'ئالان', 'ئامانج', 'ئامەد', 'ئانوبانینی', 'ئاوات', 'ئاودەڵ', 'ئاودێر', 'ئاڕاڕات', 'ئەردەوان', 'ئەردەڵان', 'ئەرزین', 'ئەرژانگ', 'ئەرسەلان', 'ئەریوان', 'ئەزمەڕ', 'ئەژدەر', 'ئەنگێز', 'ئەڤداڵ', 'ئومێد', 'ئۆرخان', 'ئۆردو', 'ئیلخان', 'ئیلیان', 'ئێزید', 'ئێڵبەگ', 'باباگوڕگوڕ', 'بابان', 'بابۆ', 'باخەوان', 'باخۆ', 'بارام', 'بارزان', 'بازو', 'بازیان', 'باساك', 'باسكار', 'باكوور', 'باكۆ', 'بانیاس', 'باهۆ', 'باهۆز', 'باوان', 'باڵەك', 'برزوو', 'بروسك', 'بروسكە', 'بەختیار', 'بەدرخان', 'بەرخۆ', 'بەرزان', 'بەرزە', 'بەرهەم', 'بەشدار', 'بەكۆ', 'بەمۆ', 'بەنگین', 'بەهرۆز', 'بەهزاد', 'بەهێز', 'بەڵێن', 'بڕیار', 'بۆتان', 'بیردۆز', 'بیژەن', 'بێخود', 'بێستوون', 'بێكەس', 'بێوار', 'پاداشت', 'پاكۆ', 'پاڵە', 'پشتیوان', 'پشكۆ', 'پەرۆش', 'پەرێز', 'پەسەند', 'پەشێو', 'پەنهان', 'پەیوەند', 'پۆڵا', 'پۆڵاين', 'پیرۆ', 'پیرۆت', 'پێشەنگ', 'پێشەوا', 'پێڕش', 'تاژدین', 'تۆڵە', 'تیشكۆ', 'جەزا', 'جوانڕۆ', 'جووتكار', 'جووتیار', 'جۆڵا', 'جێگر', 'چاپك', 'چالاك', 'چەكۆ', 'چیا', 'چیاوار', 'خاكی', 'خان', 'خانی', 'خانێ', 'خاڵدی', 'خاڵۆ', 'خەبات', 'خەسرەو', 'خەیاس', 'خورشید', 'خۆربین', 'خۆشناو', 'خۆيبوون', 'خێڵ', 'دابان', 'دارا', 'دارەشمانە', 'دارەوان', 'دارۆ', 'داس', 'داستان', 'داسن', 'داكۆ', 'دالان', 'دانا', 'دانار', 'دانش', 'دانەر', 'دانۆ', 'دانیار', 'دژوار', 'دلاوەر', 'دلێر', 'دەرسیم', 'دەشتی', 'دەشتیوان', 'دەوەن', 'دووربین', 'دڵان', 'دڵدار', 'دڵشاد', 'دۆستی', 'دیار', 'دیاكۆ', 'دیلمان', 'دیوانە', 'دێوار', 'زاخۆ', 'زارۆ', 'زاگرۆز', 'زاگرۆس', 'زامدار', 'زانا', 'زانكۆ', 'زانوەر', 'زانیار', 'زمناكۆ', 'زەبوون', 'زەرتەشت', 'زەردەشت', 'زەند', 'زەنوێر', 'زەهاو', 'زەیتۆ', 'زۆراب', 'زۆزك', 'زیرەك', 'زێد', 'زێڕۆ', 'ژەنیار', 'ژیار', 'ژیر',
        'ئارا', 'ئارزۆك', 'ئارۆس', 'ئاریا', 'ئاریاكۆ', 'ئاریان', 'ئاریانكۆ', 'ئارین', 'ئازو', 'ئاسان', 'ئاستیاگ', 'ئاسۆس', 'ئاشتی', 'ئاكار', 'ئاهۆرا', 'ئاواد', 'ئاوارە', 'ئاودەنگ', 'ئاوەز', 'ئاڕۆنا', 'ئاڤێستان', 'ئایار', 'ئەژی', 'ئەژین', 'ئەلەند', 'ئەوراد', 'ئەڤرەس', 'ئیریەن', 'ئیلام', 'باتێ', 'بادینان', 'باران', 'باسان', 'بالیسان', 'بانە', 'بەتین', 'بەخشی', 'بەرات', 'بەرخان', 'بەرزا', 'بەكار', 'بەهات', 'بەهرەوەر', 'بەڕێز', 'بڕست', 'بۆژین', 'بۆكان', 'بۆكورد', 'بینار', 'بێخەم', 'بێخەو', 'بێدار', 'پاسار', 'پايز', 'پەروەر', 'پەروەرد', 'پەسار', 'پەیام', 'پەیمان', 'پەیوەست', 'پێشمەرگە', 'پێشین', 'تارۆ', 'تامان', 'تكا', 'تەمەن', 'تەمۆ', 'جانۆ', 'جمان', 'جەهان', 'جوان', 'جودی', 'جیهان', 'چاوكاڵ', 'چاوگەش', 'چاوڕەش', 'چیاڤان', 'خاپوور', 'خاك', 'خامە', 'خانان', 'خاوەن', 'خەمان', 'خەون', 'خەڵات', 'خولیا', 'خومار', 'خوێندكار', 'خۆر', 'خۆرژین', 'خۆرلێر', 'خۆشبین', 'خێڵان', 'دارین', 'داسۆ', 'داهات', 'داهێن', 'داوەر', 'دایری', 'دلۆ', 'دەروون', 'دەستان', 'دەشتێو', 'دەوار', 'دوانگە', 'دواڕۆژ', 'دڵبرین', 'دڵزار', 'دڵكورد', 'دڵگاز', 'دۆستان', 'دیدار', 'دیدەم', 'دیلان', 'دینۆ', 'دێریاس', 'دێنی', 'رەوێن', 'زاموا', 'زریان', 'زنار', 'زەنگەنە', 'زێڕیڤان', 'ژارۆ', 'ژیلۆ', 'ژین', 'سانۆ', 'سانیار', 'ساوێن', 'ساڕێژ', 'سلیڤان', 'سلێڤان', 

    );

    /**
     * @link http://muslim-names.us/
     */
    protected static $firstNameFemale = array(
        'ئاران', 'ئارەزوو', 'ئاریانا', 'ئارێز', 'ئازیز', 'ئازێ', 'ئاسكە', 'ئاسكۆڵ', 'ئاسمان', 'ئاشنا', 'ئالین', 'ئامان', 'ئامێز', 'ئاهەنگ', 'ئاوار', 'ئاواز', 'ئاوان', 'ئاورنگ', 'ئاونگ', 'ئاوین', 'ئاوێز', 'ئاوێزان', 'ئاوێزە', 'ئاوێن', 'ئاڤار', 'ئاڤێستا', 'ئاڵا', 'ئەختەر', 'ئەرسین', 'ئەشك', 'ئەفسوس', 'ئەوین', 'ئەڤین', 'ئەڵماس', 'ئیرەم', 'باخات', 'باخان', 'باخە', 'باخی', 'بانو', 'بانۆ', 'بانێ', 'باڵا', 'بناو', 'بەراو', 'بەرخە', 'بەرخی', 'بەرزی', 'بەرفین', 'بەستۆرە', 'بەسۆز', 'بەفراو', 'بەفرە', 'بەفرین', 'بەناز', 'بەهار', 'بەهرە', 'بەهەست', 'بەهێ', 'بەڕۆژ', 'بەیان', 'بێخال', 'بێری', 'بێریوان', 'بێریڤان', 'بێگەرد', 'پاراو', 'پاكیزە', 'پرژە', 'پەپولە', 'پەخشان', 'پەرژین', 'پەرست', 'پەروا', 'پەروانە', 'پەروین', 'پەری', 'پەریا', 'پەریخان', 'پەریزاد', 'پەریناز', 'پیرۆز', 'تابان', 'تابلۆ', 'تابین', 'تادوهیبا', 'تارا', 'تاسە', 'تاشان', 'تانیا', 'تاڤان', 'تاڤگە', 'تروسكە', 'ترێ', 'تەرزە', 'تەلار', 'تەلان', 'تەمە', 'توێشوو', 'تیشك', 'تیشكان', 'تیشۆ', 'جریوە', 'جوانك', 'چاوان', 'چاومەست', 'چرا', 'چرۆ', 'چنار', 'چنوور', 'چەمان', 'چەمانە', 'چەمەن', 'چورچرا', 'چۆپی', 'چۆمان', 'چیمەن', 'چینە', 'حەیران', 'خانزاد', 'خانم', 'خاوەر', 'خاڵان', 'خەج', 'خەجۆ', 'خەرامان', 'خەرمان', 'خەزان', 'خەزاڵ', 'خەزێ', 'خەندە', 'خولدا', 'خوناو', 'خونچە', 'خۆشەویست', 'دالیا', 'دانیا', 'درەخشان', 'دلۆڤان', 'دەریا', 'دەشنێ', 'دەلال', 'دولبەر', 'دڵانپار', 'دڵخواز', 'دڵخۆش', 'دڵڤین', 'دڵیار', 'دیدەن', 'دییە', 'دێبەر', 'دێرین', 'دێریڤان', 'زارا', 'زاری', 'زامبیا', 'زەرێ', 'زیلان', 'زین', 'زیوین', 'ژاڵە', 'ژەنین', 'ژوان', 'ژیان', 'ژیران', 'ژیلا', 'ژینا', 'ژیناو', 'ژینۆ', 'ژیوار', 'سارا', 'سارین', 'سازان', 'سانا', 'ساو', 'ساوا', 'ساوان', 'ساوێن', 'ساڤۆ', 'سایە', 'ستارە', 'ستێر', 'سروە', 'سزان', 'سەما', 'سەنار', 'سەناریا', 'سەهەند', 'سەوزە', 'سەیران', 'سۆز', 'سۆزان', 'سۆلا', 'سۆلاڤ', 'سۆلین', 'سۆمان', 'سیرین', 'سیلۆنا', 'سیما', 'سینە',
        'ئارا', 'ئارزۆك', 'ئارۆس', 'ئاریا', 'ئاریاكۆ', 'ئاریان', 'ئاریانكۆ', 'ئارین', 'ئازو', 'ئاسان', 'ئاستیاگ', 'ئاسۆس', 'ئاشتی', 'ئاكار', 'ئاهۆرا', 'ئاواد', 'ئاوارە', 'ئاودەنگ', 'ئاوەز', 'ئاڕۆنا', 'ئاڤێستان', 'ئایار', 'ئەژی', 'ئەژین', 'ئەلەند', 'ئەوراد', 'ئەڤرەس', 'ئیریەن', 'ئیلام', 'باتێ', 'بادینان', 'باران', 'باسان', 'بالیسان', 'بانە', 'بەتین', 'بەخشی', 'بەرات', 'بەرخان', 'بەرزا', 'بەكار', 'بەهات', 'بەهرەوەر', 'بەڕێز', 'بڕست', 'بۆژین', 'بۆكان', 'بۆكورد', 'بینار', 'بێخەم', 'بێخەو', 'بێدار', 'پاسار', 'پايز', 'پەروەر', 'پەروەرد', 'پەسار', 'پەیام', 'پەیمان', 'پەیوەست', 'پێشمەرگە', 'پێشین', 'تارۆ', 'تامان', 'تكا', 'تەمەن', 'تەمۆ', 'جانۆ', 'جمان', 'جەهان', 'جوان', 'جودی', 'جیهان', 'چاوكاڵ', 'چاوگەش', 'چاوڕەش', 'چیاڤان', 'خاپوور', 'خاك', 'خامە', 'خانان', 'خاوەن', 'خەمان', 'خەون', 'خەڵات', 'خولیا', 'خومار', 'خوێندكار', 'خۆر', 'خۆرژین', 'خۆرلێر', 'خۆشبین', 'خێڵان', 'دارین', 'داسۆ', 'داهات', 'داهێن', 'داوەر', 'دایری', 'دلۆ', 'دەروون', 'دەستان', 'دەشتێو', 'دەوار', 'دوانگە', 'دواڕۆژ', 'دڵبرین', 'دڵزار', 'دڵكورد', 'دڵگاز', 'دۆستان', 'دیدار', 'دیدەم', 'دیلان', 'دینۆ', 'دێریاس', 'دێنی', 'رەوێن', 'زاموا', 'زریان', 'زنار', 'زەنگەنە', 'زێڕیڤان', 'ژارۆ', 'ژیلۆ', 'ژین', 'سانۆ', 'سانیار', 'ساوێن', 'ساڕێژ', 'سلیڤان', 'سلێڤان',

    );

    protected static $lastName = array(
        'ئاراز', 'ئاراس', 'ئارام', 'ئاری', 'ئاریانزادە', 'ئازا', 'ئازاد', 'ئاسنگەر', 'ئاسۆ', 'ئاكام', 'ئاكۆ', 'ئاكۆیان', 'ئاگا', 'ئاگری', 'ئاگرین', 'ئالان', 'ئامانج', 'ئامەد', 'ئانوبانینی', 'ئاوات', 'ئاودەڵ', 'ئاودێر', 'ئاڕاڕات', 'ئەردەوان', 'ئەردەڵان', 'ئەرزین', 'ئەرژانگ', 'ئەرسەلان', 'ئەریوان', 'ئەزمەڕ', 'ئەژدەر', 'ئەنگێز', 'ئەڤداڵ', 'ئومێد', 'ئۆرخان', 'ئۆردو', 'ئیلخان', 'ئیلیان', 'ئێزید', 'ئێڵبەگ', 'باباگوڕگوڕ', 'بابان', 'بابۆ', 'باخەوان', 'باخۆ', 'بارام', 'بارزان', 'بازو', 'بازیان', 'باساك', 'باسكار', 'باكوور', 'باكۆ', 'بانیاس', 'باهۆ', 'باهۆز', 'باوان', 'باڵەك', 'برزوو', 'بروسك', 'بروسكە', 'بەختیار', 'بەدرخان', 'بەرخۆ', 'بەرزان', 'بەرزە', 'بەرهەم', 'بەشدار', 'بەكۆ', 'بەمۆ', 'بەنگین', 'بەهرۆز', 'بەهزاد', 'بەهێز', 'بەڵێن', 'بڕیار', 'بۆتان', 'بیردۆز', 'بیژەن', 'بێخود', 'بێستوون', 'بێكەس', 'بێوار', 'پاداشت', 'پاكۆ', 'پاڵە', 'پشتیوان', 'پشكۆ', 'پەرۆش', 'پەرێز', 'پەسەند', 'پەشێو', 'پەنهان', 'پەیوەند', 'پۆڵا', 'پۆڵاين', 'پیرۆ', 'پیرۆت', 'پێشەنگ', 'پێشەوا', 'پێڕش', 'تاژدین', 'تۆڵە', 'تیشكۆ', 'جەزا', 'جوانڕۆ', 'جووتكار', 'جووتیار', 'جۆڵا', 'جێگر', 'چاپك', 'چالاك', 'چەكۆ', 'چیا', 'چیاوار', 'خاكی', 'خان', 'خانی', 'خانێ', 'خاڵدی', 'خاڵۆ', 'خەبات', 'خەسرەو', 'خەیاس', 'خورشید', 'خۆربین', 'خۆشناو', 'خۆيبوون', 'خێڵ', 'دابان', 'دارا', 'دارەشمانە', 'دارەوان', 'دارۆ', 'داس', 'داستان', 'داسن', 'داكۆ', 'دالان', 'دانا', 'دانار', 'دانش', 'دانەر', 'دانۆ', 'دانیار', 'دژوار', 'دلاوەر', 'دلێر', 'دەرسیم', 'دەشتی', 'دەشتیوان', 'دەوەن', 'دووربین', 'دڵان', 'دڵدار', 'دڵشاد', 'دۆستی', 'دیار', 'دیاكۆ', 'دیلمان', 'دیوانە', 'دێوار', 'زاخۆ', 'زارۆ', 'زاگرۆز', 'زاگرۆس', 'زامدار', 'زانا', 'زانكۆ', 'زانوەر', 'زانیار', 'زمناكۆ', 'زەبوون', 'زەرتەشت', 'زەردەشت', 'زەند', 'زەنوێر', 'زەهاو', 'زەیتۆ', 'زۆراب', 'زۆزك', 'زیرەك', 'زێد', 'زێڕۆ', 'ژەنیار', 'ژیار', 'ژیر',

    );

    protected static $titleMale = array('بەڕێز', 'مامۆستا', 'دکتۆر', 'ئەندازیار');
    protected static $titleFemale = array('بەرێز', 'مامۆستا', 'دکتۆرە', 'ئەندازیار');
    private static $prefix = array('ب.', 'م.', 'د.', 'ئ.');

    /**
    
     */
    public static function prefix()
    {
        return static::randomElement(static::$prefix);
    }

    /**
     * @example 1010101010
     */
    public static function idNumber()
    {
        $partialValue = static::numerify(
            static::randomElement(array(1, 2)) . str_repeat('#', 8)
        );
        return Luhn::generateLuhnNumber($partialValue);
    }

    /**
     * @example 1010101010
     */
    public static function nationalIdNumber()
    {
        $partialValue = static::numerify(1 . str_repeat('#', 8));
        return Luhn::generateLuhnNumber($partialValue);
    }

    /**
     * @example 2010101010
     */
    public static function foreignerIdNumber()
    {
        $partialValue = static::numerify(2 . str_repeat('#', 8));
        return Luhn::generateLuhnNumber($partialValue);
    }
}
